task-tracker-1c/src/Documents/тз_Задание/тз_Задание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>тз_Задание</name>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.тз_Трудозатраты</registerRecords>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.тз_ОснованиеЗадания</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.тз_СостоянияЗаданий</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВыполнения</name>
    <type>
      <types>EnumRef.тз_СтатусыВыполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>DefinedType.тз_Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>DefinedType.тз_Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗадания</name>
    <type>
      <types>CatalogRef.тз_ВидыЗаданий</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.тз_Приоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Этап</name>
    <type>
      <types>DefinedType.тз_Этапы</types>
    </type>
  </attributes>
  <attributes>
    <name>Профиль</name>
    <type>
      <types>CatalogRef.тз_ПрофилиЗаданий</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийИсполнитель</name>
    <type>
      <types>DefinedType.тз_Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Компоненты</name>
    <attributes>
      <name>Компонент</name>
      <type>
        <types>CatalogRef.тз_Компоненты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

task-tracker-1c/src/Catalogs/тз_ПрофилиЗаданий/тз_ПрофилиЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>тз_ПрофилиЗаданий</name>
  <predefined>
    <items>
      <name>ОсновнойПрофиль</name>
      <description>Основной профиль</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксЗаданий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеВидыАналитик</name>
    <attributes>
      <name>Аналитика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.тз_ВидыАналитик</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоУмолчанию</name>
      <type>
        <types>Characteristic.тз_ВидыАналитик</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВСписке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеВидыЗаданий</name>
    <attributes>
      <name>ВидЗадания</name>
      <type>
        <types>CatalogRef.тз_ВидыЗаданий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеСостоянияЗаданий</name>
    <attributes>
      <name>СостояниеЗадания</name>
      <type>
        <types>CatalogRef.тз_СостоянияЗаданий</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>DefinedType.тз_Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеПроекты</name>
    <attributes>
      <name>Проект</name>
      <type>
        <types>DefinedType.тз_Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответсвенный</name>
      <type>
        <types>DefinedType.тз_Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеПриоритеты</name>
    <attributes>
      <name>Приоритет</name>
      <type>
        <types>CatalogRef.тз_Приоритеты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

task-tracker-1c/src/Documents/тз_Задание/Forms/ФормаДокумента/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("Профиль", Объект.Профиль);
	
	ПрофильПриИзмененииНаСервере();
	
	тз_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗначенияАналитик,           "Задание",       Объект.Ссылка);
	тз_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Комментарии,                "Задание",       Объект.Ссылка);
	тз_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаданиеПрисоединенныеФайлы, "ВладелецФайла", Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПрофильПриИзмененииНаСервере();
	
	тз_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗначенияАналитик,           "Задание",       ТекущийОбъект.Ссылка);
	тз_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Комментарии,                "Задание",       ТекущийОбъект.Ссылка);
	тз_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаданиеПрисоединенныеФайлы, "ВладелецФайла", ТекущийОбъект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	тз_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗначенияАналитик,           "Задание",       ТекущийОбъект.Ссылка);
	тз_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Комментарии,                "Задание",       ТекущийОбъект.Ссылка);
	тз_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаданиеПрисоединенныеФайлы, "ВладелецФайла", ТекущийОбъект.Ссылка);
		
КонецПроцедуры

&НаСервере
Процедура ПрофильПриИзмененииНаСервере()
	
	Справочники.тз_ПрофилиЗаданий.ПолучитьПереченьСостоянийЗаданий(Объект.Профиль, Элементы.Состояние.СписокВыбора);
	Справочники.тз_ПрофилиЗаданий.ПолучитьПереченьВидовЗаданий(Объект.Профиль, Элементы.ВидЗадания.СписокВыбора);
	Справочники.тз_ПрофилиЗаданий.ПолучитьПереченьПриоритетов(Объект.Профиль, Элементы.Приоритет.СписокВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	
	ПрофильПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти   

#Область ОбработчикиСобытийЭлементовШапкиФормы
#КонецОбласти

#Область ОбработчикиКомандФормы 

#КонецОбласти   

#Область СлужебныеПроцедурыИФункции
#КонецОбласти
